"DDAutoLayoutDimensionTooLarge" = "自动调整版面维度太大";
"DDAutoLayoutError" = "自动调整版面错误";
"DDCairoCreateError" = "创建 Cairo 错误";
"DDCMDAddDiagramEntity" = "添加实体 \"%s\" 到 \"%s\"";
"DDCMDAddDiagramTable" = "添加表 \"%s\" 到 \"%s\"";
"DDCMDAddDiagramView" = "添加视图 \"%s\" 到 \"%s\"";
"DDCMDAddXDiagramEntities" = "添加 %d 个实体到 \"%s\"";
"DDCMDAddXDiagramTables" = "添加 %d 个表到 \"%s\"";
"DDCMDAddXDiagramViews" = "添加 %d 个视图到 \"%s\"";
"DDCMDAlignDiagramObjects" = "对齐对象";
"DDCMDAutoLayout" = "自动调整版面";
"DDCMDChangeArrowVertices" = "更改箭头 \"%s\" 的顶点";
"DDCMDChangeForeignKeyVertices" = "更改外键 \"%s\" 的顶点";
"DDCMDChangeLineVertices" = "更改线条 \"%s\" 的顶点";
"DDCMDChangeModelObjectComment" = "编辑表 \"%s\" 的注释";
"DDCMDChangeRelationVertices" = "更改关系 \"%s\" 的顶点";
"DDCMDChangeViewRelationVertices" = "更改视图关系的顶点";
"DDCMDCreateDiagram" = "创建图表 \"%s\"";
"DDCMDCreateDiagramArrow" = "创建箭头 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramCloud" = "创建云形 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramDatabase" = "创建数据库 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramDesktop" = "创建桌面 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramEllipse" = "创建椭圆 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramEntity" = "创建实体 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramImage" = "创建图像 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramLabel" = "创建标签 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramLayer" = "创建层 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramLine" = "创建线条 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramMobile" = "创建移动设备 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramNote" = "创建笔记 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramRectangle" = "创建矩形 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramServer" = "创建服务器 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramTable" = "创建表 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramTrigger" = "创建触发器 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramUser" = "创建用户 \"%s\" 在图表 \"%s\"";
"DDCMDCreateDiagramView" = "创建视图 \"%s\" 在图表 \"%s\"";
"DDCMDCreateModel" = "创建模型";
"DDCMDCreateModelDBSchema" = "创建模式 \"%s\"";
"DDCMDCreateModelEntity" = "创建实体 \"%s\"";
"DDCMDCreateModelField" = "创建字段 \"%s\".\"%s\"";
"DDCMDCreateModelForeignKey" = "创建外键 \"%s\"";
"DDCMDCreateModelIndex" = "创建索引 \"%s\".\"%s\"";
"DDCMDCreateModelRelation" = "创建关系 \"%s\"";
"DDCMDCreateModelTable" = "创建表 \"%s\"";
"DDCMDCreateModelUnique" = "创建唯一键 \"%s\".\"%s\"";
"DDCMDCreateModelView" = "创建视图 \"%s\"";
"DDCMDDeleteDiagram" = "删除图表 \"%s\"";
"DDCMDDeleteDiagramArrow" = "删除箭头 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramCloud" = "删除云形 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramDatabase" = "删除数据库 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramDesktop" = "删除桌面 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramEllipse" = "删除椭圆 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramEntity" = "删除实体 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramImage" = "删除图像 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramLabel" = "删除标签 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramLayer" = "删除层 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramLine" = "删除线条 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramMobile" = "删除移动设备 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramNote" = "删除笔记 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramObjects" = "在图表 \"%s\" 删除对象";
"DDCMDDeleteDiagramRectangle" = "删除矩形 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramServer" = "删除服务器 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramTable" = "删除表 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramTrigger" = "删除触发器 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramUser" = "删除用户 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteDiagramView" = "删除视图 \"%s\" 在图表 \"%s\"";
"DDCMDDeleteModelEntity" = "删除实体 \"%s\"";
"DDCMDDeleteModelField" = "删除字段 \"%s\".\"%s\"";
"DDCMDDeleteModelForeignKey" = "删除外键 \"%s\"";
"DDCMDDeleteModelIndex" = "删除索引 \"%s\".\"%s\"";
"DDCMDDeleteModelRelation" = "删除关系 \"%s\"";
"DDCMDDeleteModelTable" = "删除表 \"%s\"";
"DDCMDDeleteModelUnique" = "删除唯一键 \"%s\".\"%s\"";
"DDCMDDeleteModelView" = "删除视图 \"%s\"";
"DDCMDDistributeDiagramObjects" = "分布对象";
"DDCMDLoadModel" = "加载模型";
"DDCMDMacroAddRelatedEntities" = "添加关联的实体到图表 \"%s\"";
"DDCMDMacroAddRelatedObjects" = "添加关联的对象到 \"%s\"";
"DDCMDMacroAddRelatedTables" = "添加关联的表到图表 \"%s\"";
"DDCMDMacroCut" = "剪切";
"DDCMDMacroDeleteDiagramForeignKeyAllVertices" = "更改在 \"%s\" 的外键的顶点";
"DDCMDMacroDeleteDiagramRelationAllVertices" = "更改在 \"%s\" 的关系的顶点";
"DDCMDMacroDeleteModelObjects" = "删除对象";
"DDCMDMacroDesignEntity" = "设计实体 \"%s\"";
"DDCMDMacroDesignTable" = "设计表 \"%s\"";
"DDCMDMacroDesignView" = "设计视图 \"%s\"";
"DDCMDMacroImportEntities" = "导入实体";
"DDCMDMacroImportTables" = "导入表";
"DDCMDMacroPaste" = "粘贴";
"DDCMDMacroReorderObjectsBack" = "将对象置于底层";
"DDCMDMacroReorderObjectsFront" = "将对象置于顶层";
"DDCMDMacroSetBoldToObjects" = "更改对象的粗细";
"DDCMDMacroSetObjectsColor" = "更改对象的颜色";
"DDCMDMoveDiagramArrow" = "移动箭头 \"%s\"";
"DDCMDMoveDiagramCloud" = "移动云形 \"%s\"";
"DDCMDMoveDiagramDatabase" = "移动数据库 \"%s\"";
"DDCMDMoveDiagramDesktop" = "移动桌面 \"%s\"";
"DDCMDMoveDiagramEllipse" = "移动椭圆 \"%s\" ";
"DDCMDMoveDiagramEntity" = "移动实体 \"%s\"";
"DDCMDMoveDiagramImage" = "移动图像 \"%s\"";
"DDCMDMoveDiagramLabel" = "移动标签 \"%s\"";
"DDCMDMoveDiagramLayer" = "移动层 \"%s\"";
"DDCMDMoveDiagramLine" = "移动线条 \"%s\"";
"DDCMDMoveDiagramMobile" = "移动移动设备 \"%s\"";
"DDCMDMoveDiagramNote" = "移动笔记 \"%s\"";
"DDCMDMoveDiagramObjects" = "移动对象";
"DDCMDMoveDiagramRectangle" = "移动矩形 \"%s\"";
"DDCMDMoveDiagramServer" = "移动服务器 \"%s\"";
"DDCMDMoveDiagramShape" = "移动形状 \"%s\"";
"DDCMDMoveDiagramTable" = "移动表 \"%s\"";
"DDCMDMoveDiagramTrigger" = "移动触发器 \"%s\"";
"DDCMDMoveDiagramUser" = "移动用户 \"%s\"";
"DDCMDMoveDiagramView" = "移动视图 \"%s\"";
"DDCMDMoveModelField" = "重新排列欄位 \"%s\".\"%s\"";
"DDCMDRenameDiagram" = "重命名表 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramArrow" = "重命名箭头 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramCloud" = "重命名云形 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramDatabase" = "重命名数据库 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramDesktop" = "重命名桌面 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramEllipse" = "重命名椭圆 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramLine" = "重命名线条 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramMobile" = "重命名移动设备 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramRectangle" = "重命名矩形 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramServer" = "重命名服务器 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramTrigger" = "重命名触发器 \"%s\" 为 \"%s\"";
"DDCMDRenameDiagramUser" = "重命名用户 \"%s\" 为 \"%s\"";
"DDCMDRenameEntity" = "重命名实体 \"%s\" 为 \"%s\"";
"DDCMDRenameForeignKey" = "重命名外键 \"%s\" 为 \"%s\"";
"DDCMDRenameImage" = "重命名图像 \"%s\" 为 \"%s\"";
"DDCMDRenameLabel" = "重命名标签 \"%s\" 为 \"%s\"";
"DDCMDRenameLayer" = "重命名层 \"%s\" 为 \"%s\"";
"DDCMDRenameModelField" = "重命名字段 \"%s\".\"%s\" 为 \"%s\".\"%s\"";
"DDCMDRenameNote" = "重命名笔记 \"%s\" 为 \"%s\"";
"DDCMDRenameRelation" = "重命名关系 \"%s\" 为 \"%s\"";
"DDCMDRenameTable" = "重命名表 \"%s\" 为 \"%s\"";
"DDCMDRenameView" = "重命名视图 \"%s\" 为 \"%s\"";
"DDCMDReorderDiagramArrowBack" = "将箭头 \"%s\" 置于底层";
"DDCMDReorderDiagramArrowFront" = "将箭头 \"%s\" 置于顶层";
"DDCMDReorderDiagramCloudBack" = "将云形 \"%s\" 置于底层";
"DDCMDReorderDiagramCloudFront" = "将云形 \"%s\" 置于顶层";
"DDCMDReorderDiagramDatabaseBack" = "将数据库 \"%s\" 置于底层";
"DDCMDReorderDiagramDatabaseFront" = "将数据库 \"%s\" 置于顶层";
"DDCMDReorderDiagramDesktopBack" = "将桌面 \"%s\" 置于底层";
"DDCMDReorderDiagramDesktopFront" = "将桌面 \"%s\" 置于顶层";
"DDCMDReorderDiagramEllipseBack" = "将椭圆 \"%s\" 置于底层";
"DDCMDReorderDiagramEllipseFront" = "将椭圆 \"%s\" 置于顶层";
"DDCMDReorderDiagramEntityBack" = "将实体 \"%s\" 置于底层";
"DDCMDReorderDiagramEntityFront" = "将实体 \"%s\" 置于顶层";
"DDCMDReorderDiagramImageBack" = "将图像 \"%s\" 置于底层";
"DDCMDReorderDiagramImageFront" = "将图像 \"%s\" 置于顶层";
"DDCMDReorderDiagramLabelBack" = "将标签 \"%s\" 置于底层";
"DDCMDReorderDiagramLabelFront" = "将标签 \"%s\" 置于顶层";
"DDCMDReorderDiagramLayerBack" = "将层 \"%s\" 置于底层";
"DDCMDReorderDiagramLayerFront" = "将层 \"%s\" 置于顶层";
"DDCMDReorderDiagramLineBack" = "将线条 \"%s\" 置于底层";
"DDCMDReorderDiagramLineFront" = "将线条 \"%s\" 置于顶层";
"DDCMDReorderDiagramMobileBack" = "将移动设备 \"%s\" 置于底层";
"DDCMDReorderDiagramMobileFront" = "将移动设备 \"%s\" 置于顶层";
"DDCMDReorderDiagramNoteBack" = "将笔记 \"%s\" 置于底层";
"DDCMDReorderDiagramNoteFront" = "将笔记 \"%s\" 置于顶层";
"DDCMDReorderDiagramRectangleBack" = "将矩形 \"%s\" 置于底层";
"DDCMDReorderDiagramRectangleFront" = "将矩形 \"%s\" 置于顶层";
"DDCMDReorderDiagramServerBack" = "将服务器 \"%s\" 置于底层";
"DDCMDReorderDiagramServerFront" = "将服务器 \"%s\" 置于顶层";
"DDCMDReorderDiagramTableBack" = "将表 \"%s\" 置于底层";
"DDCMDReorderDiagramTableFront" = "将表 \"%s\" 置于顶层";
"DDCMDReorderDiagramTriggerBack" = "将触发器 \"%s\" 置于底层";
"DDCMDReorderDiagramTriggerFront" = "将触发器 \"%s\" 置于顶层";
"DDCMDReorderDiagramUserBack" = "将用户 \"%s\" 置于底层";
"DDCMDReorderDiagramUserFront" = "将用户 \"%s\" 置于顶层";
"DDCMDReorderDiagramViewBack" = "将视图 \"%s\" 置于底层";
"DDCMDReorderDiagramViewFront" = "将视图 \"%s\" 置于顶层";
"DDCMDResizeDiagramArrow" = "调整箭头 \"%s\" 的大小";
"DDCMDResizeDiagramCloud" = "调整云形 \"%s\" 的大小";
"DDCMDResizeDiagramDatabase" = "调整数据库 \"%s\" 的大小";
"DDCMDResizeDiagramDesktop" = "调整桌面 \"%s\" 的大小";
"DDCMDResizeDiagramEllipse" = "调整椭圆 \"%s\" 的大小";
"DDCMDResizeDiagramEntity" = "调整实体 \"%s\" 的大小";
"DDCMDResizeDiagramImage" = "调整图像 \"%s\" 的大小";
"DDCMDResizeDiagramLabel" = "调整标签 \"%s\" 的大小";
"DDCMDResizeDiagramLayer" = "调整层 \"%s\" 的大小";
"DDCMDResizeDiagramLine" = "调整线条 \"%s\" 的大小";
"DDCMDResizeDiagramMobile" = "调整移动设备 \"%s\" 的大小";
"DDCMDResizeDiagramNote" = "调整笔记 \"%s\" 的大小";
"DDCMDResizeDiagramObjects" = "调整对象的大小";
"DDCMDResizeDiagramRectangle" = "调整矩形 \"%s\" 的大小";
"DDCMDResizeDiagramServer" = "调整服务器 \"%s\" 的大小";
"DDCMDResizeDiagramTable" = "调整表 \"%s\" 的大小";
"DDCMDResizeDiagramTrigger" = "调整触发器 \"%s\" 的大小";
"DDCMDResizeDiagramUser" = "调整用户 \"%s\" 的大小";
"DDCMDResizeDiagramView" = "调整视图 \"%s\" 的大小";
"DDCMDSetDatabaseType" = "更改图表类型为 %s";
"DDCMDSetDatabaseVersion" = "更改数据库版本";
"DDCMDSetDiagramArrowBeginArrowStyle" = "更改箭头 \"%s\" 的箭头开始样式";
"DDCMDSetDiagramArrowBold" = "更改箭头 \"%s\" 的粗细";
"DDCMDSetDiagramArrowColor" = "更改箭头 \"%s\" 的颜色";
"DDCMDSetDiagramArrowEndArrowStyle" = "更改箭头 \"%s\" 的箭头结束样式";
"DDCMDSetDiagramArrowOpacity" = "更改箭头 \"%s\" 的透明度";
"DDCMDSetDiagramBlackWhite" = "更改图表 \"%s\" 为 \"黑白\"";
"DDCMDSetDiagramCloudBold" = "更改云形 \"%s\" 的粗细";
"DDCMDSetDiagramCloudColor" = "更改云形 \"%s\" 的颜色";
"DDCMDSetDiagramCloudOpacity" = "更改云形 \"%s\" 的透明度";
"DDCMDSetDiagramColor" = "更改图表 \"%s\" 为 \"颜色\"";
"DDCMDSetDiagramDatabaseBold" = "更改数据库 \"%s\" 的粗细";
"DDCMDSetDiagramDatabaseColor" = "更改数据库 \"%s\" 的颜色";
"DDCMDSetDiagramDatabaseOpacity" = "更改数据库 \"%s\" 的透明度";
"DDCMDSetDiagramDesktopBold" = "更改桌面 \"%s\" 的粗细";
"DDCMDSetDiagramDesktopColor" = "更改桌面 \"%s\" 的颜色";
"DDCMDSetDiagramDesktopOpacity" = "更改桌面 \"%s\" 的透明度";
"DDCMDSetDiagramDimension" = "更改图表 \"%s\" 的维度";
"DDCMDSetDiagramEllipseBold" = "更改椭圆 \"%s\" 的粗细";
"DDCMDSetDiagramEllipseColor" = "更改椭圆 \"%s\" 的颜色";
"DDCMDSetDiagramEllipseOpacity" = "更改椭圆 \"%s\" 的透明度";
"DDCMDSetDiagramEntityBold" = "更改实体 \"%s\" 的粗细";
"DDCMDSetDiagramEntityColor" = "更改实体 \"%s\" 的颜色";
"DDCMDSetDiagramEntityFont" = "更改实体的字体";
"DDCMDSetDiagramEntityFontSize" = "更改实体的字体大小";
"DDCMDSetDiagramForeignKeyBold" = "更改外键 \"%s\" 的粗细";
"DDCMDSetDiagramForeignKeyColor" = "更改外键 \"%s\" 的颜色";
"DDCMDSetDiagramForeignKeyVisible" = "更改外键 \"%s\" 的可见度";
"DDCMDSetDiagramHideDBSchemaName" = "隐藏图表 \"%s\" 的模式名";
"DDCMDSetDiagramHideViewRelations" = "隐藏图表 \"%s\" 的视图关系";
"DDCMDSetDiagramImageOpacity" = "更改图像 \"%s\" 的透明度";
"DDCMDSetDiagramIndex" = "重新排列图表 \"%s\"";
"DDCMDSetDiagramLabelColor" = "更改标签 \"%s\" 的颜色";
"DDCMDSetDiagramLabelFont" = "更改标签 \"%s\" 的字体名";
"DDCMDSetDiagramLabelFontColor" = "更改标签 \"%s\" 的字体颜色";
"DDCMDSetDiagramLabelFontSize" = "更改标签 \"%s\" 的字体大小";
"DDCMDSetDiagramLabelFontStyle" = "更改标签 \"%s\" 的字体样式";
"DDCMDSetDiagramLabelOpacity" = "更改标签 \"%s\" 的透明度";
"DDCMDSetDiagramLabelText" = "编辑标签 \"%s\" 的内容";
"DDCMDSetDiagramLayerColor" = "更改层 \"%s\" 的颜色";
"DDCMDSetDiagramLayerFont" = "更改层 \"%s\" 的字体名";
"DDCMDSetDiagramLayerFontColor" = "更改层 \"%s\" 的字体颜色";
"DDCMDSetDiagramLayerFontSize" = "更改层 \"%s\" 的字体大小";
"DDCMDSetDiagramLineBold" = "更改线条 \"%s\" 的粗细";
"DDCMDSetDiagramLineCapStyle" = "更改线条 %s 的端点样式";
"DDCMDSetDiagramLineColor" = "更改线条 \"%s\" 的颜色";
"DDCMDSetDiagramLineDashStyle" = "更改线条 %s 的虚线样式";
"DDCMDSetDiagramLineJoinStyle" = "更改线条 \"%s\" 的联接样式";
"DDCMDSetDiagramLineOpacity" = "更改线条 \"%s\" 的透明度";
"DDCMDSetDiagramLinkedLabelText" = "编辑已链接的标签 \"%s\" 的内容";
"DDCMDSetDiagramLinkedLabelVisible" = "为 \"%s\" 更改描述的可见度";
"DDCMDSetDiagramLinkedNameVisible" = "为 \"%s\" 更改名的可见度";
"DDCMDSetDiagramMobileBold" = "更改移动设备 \"%s\" 的粗细";
"DDCMDSetDiagramMobileColor" = "更改移动设备 \"%s\" 的颜色";
"DDCMDSetDiagramMobileOpacity" = "更改移动设备 \"%s\" 的透明度";
"DDCMDSetDiagramNotation" = "更改图表 \"%s\" 的符号";
"DDCMDSetDiagramNoteColor" = "更改笔记 \"%s\" 的颜色";
"DDCMDSetDiagramNoteFont" = "更改笔记 \"%s\" 的字体名";
"DDCMDSetDiagramNoteFontColor" = "更改笔记 \"%s\" 的字体颜色";
"DDCMDSetDiagramNoteFontSize" = "更改笔记 \"%s\" 的字体大小";
"DDCMDSetDiagramNoteFontStyle" = "更改笔记 \"%s\" 的字体样式";
"DDCMDSetDiagramNoteStyle" = "更改笔记 \"%s\" 的样式";
"DDCMDSetDiagramNoteText" = "编辑笔记 \"%s\" 的内容";
"DDCMDSetDiagramRectangleBold" = "更改矩形 \"%s\" 的粗细";
"DDCMDSetDiagramRectangleColor" = "更改矩形 \"%s\" 的颜色";
"DDCMDSetDiagramRectangleOpacity" = "更改矩形 \"%s\" 的透明度";
"DDCMDSetDiagramRelationBold" = "更改关系 \"%s\" 的粗细";
"DDCMDSetDiagramRelationColor" = "更改关系 \"%s\" 的颜色";
"DDCMDSetDiagramRelationVisible" = "更改关系 \"%s\" 的可见度";
"DDCMDSetDiagramServerBold" = "更改服务器 \"%s\" 的粗细";
"DDCMDSetDiagramServerColor" = "更改服务器 \"%s\" 的颜色";
"DDCMDSetDiagramServerOpacity" = "更改服务器 \"%s\" 的透明度";
"DDCMDSetDiagramShapeColor" = "更改形状 \"%s\" 的颜色";
"DDCMDSetDiagramShowDBSchemaName" = "显示图表 \"%s\" 的模式名";
"DDCMDSetDiagramShowViewRelations" = "显示图表 \"%s\" 的视图关系";
"DDCMDSetDiagramTableBold" = "更改表 \"%s\" 的粗细";
"DDCMDSetDiagramTableColor" = "更改表 \"%s\" 的颜色";
"DDCMDSetDiagramTableFont" = "更改表的字体";
"DDCMDSetDiagramTableFontSize" = "更改表的字体大小";
"DDCMDSetDiagramTriggerBold" = "更改触发器 \"%s\" 的粗细";
"DDCMDSetDiagramTriggerColor" = "更改触发器 \"%s\" 的颜色";
"DDCMDSetDiagramTriggerOpacity" = "更改触发器 \"%s\" 的透明度";
"DDCMDSetDiagramUserBold" = "更改用户 \"%s\" 的粗细";
"DDCMDSetDiagramUserColor" = "更改用户 \"%s\" 的颜色";
"DDCMDSetDiagramUserOpacity" = "更改用户 \"%s\" 的透明度";
"DDCMDSetDiagramViewBold" = "更改视图 \"%s\" 的粗细";
"DDCMDSetDiagramViewColor" = "更改视图 \"%s\" 的颜色";
"DDCMDSetDiagramViewRelationBold" = "更改视图关系 \"%s\" 的粗细";
"DDCMDSetDiagramViewRelationColor" = "更改视图关系 \"%s\" 的颜色";
"DDCMDSetModelCaseSensitivityInsenstive" = "设置模型为不区分大小写";
"DDCMDSetModelCaseSensitivitySenstive" = "设置模型为大小写相关";
"DDCMDSetModelEntityDBSchema" = "设置 \"%s\" 的模式从 \"%s\" 到 \"%s\"";
"DDCMDSetModelField" = "更新字段 \"%s\".\"%s\"";
"DDCMDSetModelFieldPrimaryKey" = "更改表 \"%s\" 的主键";
"DDCMDSetModelFieldType" = "更改 \"%s\".\"%s\" 的字段类型";
"DDCMDSetModelForeignKey" = "更新外键 \"%s\".\"%s\"";
"DDCMDSetModelForeignKeyCardinalitySource" = "更改外键 \"%s\".\"%s\" 的源基数";
"DDCMDSetModelForeignKeyCardinalityTarget" = "更改外键 \"%s\".\"%s\" 的目标基数";
"DDCMDSetModelIndex" = "更新索引 \"%s\".\"%s\"";
"DDCMDSetModelRelation" = "更新关系 \"%s\".\"%s\"";
"DDCMDSetModelRelationCardinalitySource" = "更改关系 \"%s\".\"%s\" 的源基数";
"DDCMDSetModelRelationCardinalityTarget" = "更改关系 \"%s\".\"%s\" 的目标基数";
"DDCMDSetModelTableAutoIncValue" = "更改表 \"%s\" 的自动递增值";
"DDCMDSetModelTableCharset" = "更改表 \"%s\" 的字符集";
"DDCMDSetModelTableCollation" = "更改表 \"%s\" 的排序规则";
"DDCMDSetModelTableDBSchema" = "设置 \"%s\" 的模式从 \"%s\" 到 \"%s\"";
"DDCMDSetModelTableType" = "更改 \"%s\" 的表类型";
"DDCMDSetModelUnique" = "更新唯一键 \"%s\".\"%s\"";
"DDCMDSetModelViewDBSchema" = "设置 \"%s\" 的模式从 \"%s\" 到 \"%s\"";
"DDCMDSetModelViewSelectSQL" = "更新视图 \"%s\" 的 SQL";
"DDCMDSetPage" = "更改页属性";
"DDCMDSetSchemaNameAndEntityName" = "设置 \"%s\" 为 \"%s\"";
"DDCMDSetSchemaNameAndTableName" = "设置 \"%s\" 为 \"%s\"";
"DDCMDSetSchemaNameAndViewName" = "设置 \"%s\" 为 \"%s\"";
"DDDiagramDimensionOutOfBound" = "维度应在 1 和 %d 之间。";
"DDDiagramFontSizeIsInvalid" = "图表字体大小无效。";
"DDDiagramImageInvalid" = "图表图像无效。";
"DDDiagramNotExist" = "图表不存在。";
"DDDiagramObjectNotExist" = "图表对象不存在。";
"DDDiagramTableAlreadyExist" = "图表表已存在。";
"DDFileAccessError" = "访问文件错误";
"DDInvalidHandle" = "无效的操作";
"ddl" = "DDL";
"DDMacroAlreadyStarted" = "宏指令已经开始。";
"DDModelCheckAlreadyExist" = "检查 \"%s\" 已存在。";
"DDModelCheckNameIsNotAvailable" = "检查名 \"%s\" 不可用的。";
"DDModelExcludeAlreadyExist" = "排除 \"%s\" 已存在。";
"DDModelExcludeNameIsNotAvailable" = "排除名 \"%s\" 不可用的。";
"DDModelFieldAlreadyExist" = "字段 \"%s\" 已存在。";
"DDModelFieldConversionError" = "字段 \"%s\" 无法转换。";
"DDModelFieldError" = "模型字段错误";
"DDModelFieldNotExist" = "模型字段不存在。";
"DDModelForeignKeyAlreadyExist" = "外键 \"%s\" 已存在。";
"DDModelForeignKeyError" = "模型外键错误";
"DDModelForeignKeyNotExist" = "模型外键不存在。";
"DDModelForeignKeySrcTableNotExist" = "模型外键源表不存在。";
"DDModelForeignKeyTarPKeyError" = "模型外键目标表主键错误";
"DDModelForeignKeyTarTableNotExist" = "模型外键目标表不存在。";
"DDModelIndexAlreadyExist" = "索引 \"%s\" 已存在。";
"DDModelIndexError" = "模型索引错误";
"DDModelIndexFieldError" = "模型索引字段错误";
"DDModelIndexFieldNotExist" = "模型索引字段不存在。";
"DDModelIndexNotExist" = "模型索引不存在。";
"DDModelInvalidFileFormat" = "无效的文件格式";
"DDModelNMoreColumns" = "更多（%lu 列）...";
"DDModelRelationAlreadyExist" = "关系 \"%s\" 已存在。";
"DDModelRelationError" = "模型关系错误";
"DDModelRelationNotExist" = "模型关系不存在。";
"DDModelRelationSrcTableNotExist" = "模型关系源表不存在。";
"DDModelRelationTarPKeyError" = "模型关系目标表主键错误";
"DDModelRelationTarTableNotExist" = "模型关系目标表不存在。";
"DDModelRuleAlreadyExist" = "规则 \"%s\" 已存在。";
"DDModelSaveError" = "模型保存错误：%s";
"DDModelTableNotExist" = "模型表不存在。";
"DDModelTriggerAlreadyExist" = "触发器 \"%s\" 已存在。";
"DDModelUniqueAlreadyExist" = "唯一键 \"%s\" 已存在。";
"DDModelUniqueError" = "模型唯一键错误";
"DDModelUniqueFieldError" = "模型唯一键字段错误";
"DDModelUniqueFieldNotExist" = "模型唯一键字段不存在。";
"DDModelUniqueNameIsNotAvailable" = "唯一键名 \"%s\" 不可用的。";
"DDModelUniqueNotExist" = "模型唯一键不存在。";
"DDModelVersionNotSupported" = "不支持此模型版本。";
"DDNameUsedByOtherObject" = "名 \"%s\" 已被采用。请选择一个不同的名。";
"DDNewNameCannotBeEmpty" = "名不可以是空的。请选择另一个名。";
"DDObjectsOutsideDiagram" = "图表不够大容纳全部对象。";
"DDPaperMarginsTooLarge" = "边界太大。";
"DDSyncModelError" = "同步到数据库时遇到错误";
